cf_billing/InformationRegisters/энргСтабильныеПериодыИзмерителиНаправлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтабильныеПериодыИзмерителиНаправлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючНорматива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеПлощади</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьэнргПереводПомещенияВПомещениеСРазделеннымиЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИстечениеДатыПоверкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьФормулуРасчетаТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьТехническуюВозможностьУстановкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменитьДиаметрСеченияТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменитьПлательщикаУслуги</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСтатусАбонентовОтключаемыхВНеполивнойСезон</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоПроживающих</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоКомнат</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидБлагоустройстваАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеТарифа</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьэнргОперацияСРазделеннымиЛС</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьТехническийСтатусТочкиУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменениеКоличестваПрописанныхПроживающихСобственников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменитьПризнакРасчетаТолькоПоПоказаниям</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьДатуПоверкиПУ</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначенияИзмерителей</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоПрописанных</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСоглашениеОПотребленииВПомещении</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьКоличествоСобственников</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргИзменениеЭтажностиСтроения</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьГруппуПотребителейАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьДополнительнуюСоциальнуюНорму</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтабильныеПериодыИзмерителиНаправлений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

// Заполняет стабильные периоды измерители направлений.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СтабильныеПериодыИзмерителиНаправлений(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтабильныеПериодыИзмерителиНаправлений());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, ЧастныйСектор, Строение, Помещение, Услуга, ТочкаУчета, НомерПозиции, Измеритель, ДатаРегистратора, ДокРегистратор";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

#Область ТекстыЗапросов

// Получает текст запроса стабильные периоды измерители направлений.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСтабильныеПериодыИзмерителиНаправлений() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргСтабильныеПериодыИзмерителиНаправлений.Организация КАК Организация,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Район КАК Район,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ЧастныйСектор КАК ЧастныйСектор,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Строение КАК Строение,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Помещение КАК Помещение,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Услуга КАК Услуга,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ТочкаУчета КАК ТочкаУчета,
	|	энргСтабильныеПериодыИзмерителиНаправлений.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Измеритель КАК Измеритель,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ДатаРегистратора КАК ДатаРегистратора,
	|	энргСтабильныеПериодыИзмерителиНаправлений.ДокРегистратор КАК ДокРегистратор,
	|	энргСтабильныеПериодыИзмерителиНаправлений.Количество КАК Количество,
	|	энргСтабильныеПериодыИзмерителиНаправлений.КлючНорматива КАК КлючНорматива
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериодыИзмерителиНаправлений КАК энргСтабильныеПериодыИзмерителиНаправлений";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти  

#КонецОбласти

#КонецОбласти

#КонецЕсли
